## Butter-fly
## 和田光司

ゴキゲンな蝶になって　きらめく風に乗って
今すぐ　キミに会いに行こう
余計な事なんて　忘れた方がマシさ
これ以上　シャレてる時間はない

何が　wow wow～　この空に届くのだろう
だけど　wow wow～　明日の予定もわからない

無限大な夢のあとの　何もない世の中じゃ
そうさ愛しい　想いも負けそうになるけど
Stayしがちなイメージだらけの　頼りない翼でも
きっと飛べるさ　On my love

ウカレタ蝶になって　一途な風に乗って
どこまでも　キミに会いに行こう
曖昧な言葉って　意外に便利だって
叫んでる　ヒットソング聴きながら

何が　wow wow～　この街に響くのだろう
だけど　wow wow～　期待してても仕方ない

無限大な夢のあとの　やるせない世の中じゃ
そうさ常識　はずれも悪くないかな
Stayしそうなイメージを染めた　ぎこちない翼でも
きっと飛べるさ　On my love

無限大な夢のあとの　何もない世の中じゃ
そうさ愛しい　想いも負けそうになるけど
Stayしがちなイメージだらけの　頼りない翼でも
きっと飛べるさ　Oh yeah

無限大な夢のあとの　やるせない世の中じゃ
そうさ常識　はずれも悪くないかな
Stayしそうなイメージを染めた　ぎこちない翼でも
きっと飛べるさ　On my love
