のびた人陰を　舗道に並べ
夕闇のなかをキミと歩いてる
手を繋いでいつまでもずっと
そばにいれたなら 泣けちゃうくらい

風が冷たくなって
冬の匂いがした
そろそろこの街に
キミと近付ける季節がくる

今年、最初の雪の華を
２人$寄り添って
眺めているこの時間に
シアワセがあふれだす

甘えとか弱さじゃない
ただ、キミを愛してる
心からそう思った

キミがいると どんなことでも
乗りきれるような気持ちになってる
こんな日々がいつまでもきっと
続いてくことを祈っているよ

風が窓を揺らした
夜は揺り起こして
どんな悲しいことも
ボクが笑顔へと変えてあげる

舞い落ちてきた雪の華が
窓の外ずっと
降りやむことを知らずに
ボクらの街を染める
誰かのために何かを
したいと思えるのが
愛ということを知った

もし、キミを失ったとしたなら
星になってキミを照らすだろう
笑顔も 涙に濡れてる夜も
いつもいつでもそばにいるよ

今年、最初の雪の華を
２人$寄り添って
眺めているこの時間に
シアワセがあふれだす

甘えとか弱さじゃない
ただ、キミとずっと
このまま一緒にいたい
素直にそう思える

この街に降り積もってく
真っ白な雪の華
２人の胸にそっと想い出を描くよ
これからもキミとずっと…
